Revit 2027 API
DuctSettings.GetDuctSettings Method
 Get the duct settings of the project.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DuctSettings GetDuctSettings(
	Document document
)
Public Shared Function GetDuctSettings (
	document As Document
) As DuctSettings
public:
static DuctSettings^ GetDuctSettings(
	Document^ document
)
static member GetDuctSettings :
        document : Document -> DuctSettings
Parameters
document Document
 The document.
Return Value
DuctSettings
 The duct settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace